apple-open-source/macos/IOUSBFamily/IOUSBHIDDriver/Classes/IOUSBHIDDriver.cpp
/*
 * Copyright (c) 1998-2003 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this
 * file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */


//================================================================================================
//
//   Headers
//
//================================================================================================
//
#include <libkern/OSByteOrder.h>
#include <IOKit/IOBufferMemoryDescriptor.h>
#include <IOKit/IOMessage.h>
#include <IOKit/IOTimerEventSource.h>

#include <IOKit/hid/IOHIDKeys.h>
#include <IOKit/usb/IOUSBInterface.h>
#include <IOKit/usb/IOUSBLog.h>
#include <IOKit/usb/IOUSBPipe.h>
#include <IOKit/usb/IOUSBHIDDriver.h>

/* Convert USBLog to use kprintf debugging */
#define IOUSBHIDDriver_USE_KPRINTF 0

#if IOUSBHIDDriver_USE_KPRINTF
#undef USBLog
#undef USBError
void kprintf(const char *format, ...)
__attribute__((format(printf, 1, 2)));
#define USBLog( LEVEL, FORMAT, ARGS... )  if ((LEVEL) <= 5) { kprintf( FORMAT "\n", ## ARGS ) ; }
#define USBError( LEVEL, FORMAT, ARGS... )  { kprintf( FORMAT "\n", ## ARGS ) ; }
#endif

//================================================================================================
//
//   Local Definitions
//
//================================================================================================
//
#define super IOHIDDevice

#define _workLoop							_usbHIDExpansionData->_workLoop
#define _handleReportThread					_usbHIDExpansionData->_handleReportThread
#define _rootDomain							_usbHIDExpansionData->_rootDomain
#define _wakeUpTime							_usbHIDExpansionData->_wakeUpTime
#define _completionWithTimeStamp			_usbHIDExpansionData->_completionWithTimeStamp
#define _checkForTimeStamp					_usbHIDExpansionData->_checkForTimeStamp
#define _msToIgnoreTransactionsAfterWake	_usbHIDExpansionData->_msToIgnoreTransactionsAfterWake
#define _suspendPortTimer					_usbHIDExpansionData->_suspendPortTimer
#define _portSuspended						_usbHIDExpansionData->_portSuspended
#define _suspendTimeoutInMS					_usbHIDExpansionData->_suspendTimeoutInMS
#define _interfaceNumber					_usbHIDExpansionData->_interfaceNumber
#define _logHIDReports						_usbHIDExpansionData->_logHIDReports
#define _hidLoggingLevel					_usbHIDExpansionData->_hidLoggingLevel

#define ABORTEXPECTED                       _deviceIsDead

//================================================================================================
//
//   IOUSBHIDDriver Methods
//
//================================================================================================
//
OSDefineMetaClassAndStructors(IOUSBHIDDriver, IOHIDDevice)


#pragma mark ееееееее IOService Methods еееееееее
//================================================================================================
//
//  init
//
//  Do what is necessary to start device before probe is called.
//
//================================================================================================
//
bool 
IOUSBHIDDriver::init(OSDictionary *properties)
{
    if (!super::init(properties))
    {
        return false;
    }

    // Allocate our expansion data
    //
    if (!_usbHIDExpansionData)
    {
        _usbHIDExpansionData = (IOUSBHIDDriverExpansionData *)IOMalloc(sizeof(IOUSBHIDDriverExpansionData));
        if (!_usbHIDExpansionData)
            return false;
        bzero(_usbHIDExpansionData, sizeof(IOUSBHIDDriverExpansionData));
    }
    _retryCount = kHIDDriverRetryCount;
    _maxReportSize = kMaxHIDReportSize;

    return true;
}

//================================================================================================
//
//  free
//
//================================================================================================
//
void
IOUSBHIDDriver::free()
{
    if (_gate)
    {
        if (_workLoop)
        {
			if ( _suspendPortTimer )
			{
				_workLoop->removeEventSource( _suspendPortTimer );
				_suspendPortTimer->release();
				_suspendPortTimer = NULL;
				_suspendTimeoutInMS= 0;
			}

            _workLoop->removeEventSource(_gate);
            _workLoop->release();
            _workLoop = NULL;
        }

        _gate->release();
        _gate = NULL;
    }

    //  This needs to be the LAST thing we do, as it disposes of our "fake" member
    //  variables.
    //
    if (_usbHIDExpansionData)
    {
        IOFree(_usbHIDExpansionData, sizeof(IOUSBHIDDriverExpansionData));
        _usbHIDExpansionData = NULL;
    }

super::free();
}


//=============================================================================================
//
//  start
//
//=============================================================================================
//
bool
IOUSBHIDDriver::start(IOService *provider)
{
    IOReturn			err = kIOReturnSuccess;
    IOWorkLoop	*		workLoop = NULL;
    IOCommandGate *		commandGate = NULL;
    OSNumber *			locationIDProperty = NULL;
    IOUSBFindEndpointRequest	request;
    bool				addEventSourceSuccess = false;
    UInt32				maxInputReportSize = 0;
    OSNumber * 			inputReportSize = NULL;
	OSNumber *			numberObj = NULL;
    OSObject *			propertyObj = NULL;
    
    USBLog(7, "%s[%p]::start", getName(), this);
    IncrementOutstandingIO();			// make sure that once we open we don't close until start is finished

    if (!super::start(provider))
    {
        USBError(1, "%s[%p]::start - super::start returned false!", getName(), this);
        goto ErrorExit;
    }

